<h2>3.2.- Clustering</h2>
<p>Este apartado describe c&oacute;mo utilizar el m&oacute;dulo de Clustering de EPA Explorer.</p>
<h3>Entrenamiento</h3>
<center><img src="manual/manual_3.2_img.png" height="75%" width="75%" align="middle"></center>
<p>Para realizar un entrenamiento de un sistema de clustering en EPA Explorer:</p>
<ol>
<li>El usuario selecciona la opci&oacute;n de Entrenamiento en la pesta&ntilde;a Clustering del men&uacute; principal.</li>
<li>En la vista que se presenta, el usuario podr&aacute; configurar varios par&aacute;metros de entrada para el algoritmo, como son:</li>
<ul>
<li>El ejercicio en estudio.</li>
<li>El conjunto de atributos a incorporar en el estudio.</li>
<li>Par&aacute;metros propios del algoritmo de agrupaci&oacute;n como el n&uacute;mero de conjuntos, el n&uacute;mero de intervalos para discretizar variables num&eacute;ricas, o el n&uacute;mero m&aacute;ximo de iteraciones del algoritmo.</li>
</ul>
<li>Configurados todos los par&aacute;metros, pulsar sobre el bot&oacute;n "Ejecutar" para lanzar la ejecuci&oacute;n del algoritmo.</li>
<li>Una vez el algoritmo termine su ejecuci&oacute;n, almacenara el resultado para su posterior visualizaci&oacute;n.</li>
</ol>
<h3>Visualizaci&oacute;n</h3>
<center><img src="manual/manual_3.3_img.png" height="75%" width="75%" align="middle"></center>
<p>Para visualizar el resultado de la ejecuci&oacute;n previa de un sistema de clustering en EPA Explorer:</p>
<ol>
<li>El usuario selecciona la opci&oacute;n de Visualizar en la pesta&ntilde;a Clustering del men&uacute; principal.</li>
<li>En la vista que se presenta, el usuario podr&aacute; seleccionar el fichero almacenado con una ejecuci&oacute;n anterior del algoritmo de Clustering.</li>
<li>El sistema carga la informaci&oacute;n del sistema de agrupaci&oacute;n y muestra una representaci&oacute;n visual de los mismos.</li>
<li>El usuario puede alternar a una vista tabular de los datos, donde podr&iacute;a hacer una extracci&oacute;n en Excel o PDF de los mismos.</li>
</ol>